#!/bin/bash
#command=("센트럴인버터" "스트링인버터" "인버터" "태양광모듈" "태양광" "모듈" "집적판" "능동디바이스" "발전효율" "발전전력" "주파수변동" "시각화" "모니터링" "원격관제" "모듈상태" "발전량비교" "구역별발전량비교" "구역별" "발전량" "비교" "열화상카메라" "장애시간" "드론" "이상온도" "에너지저장장치" "저장장치" "전력저장장치" "고장진단" "고장" "출력예측" "배터리화재" "각도제어" "제어" "출력제어" "발전")
command=("주파수변동" "시각화" "모니터링" "원격관제" "모듈상태" "발전량비교" "구역별발전량비교" "구역별" "발전량" "비교" "열화상카메라" "장애시간" "드론" "이상온도" "에너지저장장치" "저장장치" "전력저장장치" "고장진단" "고장" "출력예측" "배터리화재" "각도제어" "제어" "출력제어" "발전")
for i in ${command[@]}; do
    python3 keyword_data_generator.py -k $i
done
